app/controllers/posts_controller.rb

SELECT  1 AS one FROM "authors" LIMIT 1
SELECT "authors".* FROM "authors"
---
  def new
    if params[:author_id] && !Author.exists?(params[:author_id]) #if an author_id is given and an author with that id does not exist

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 123456]]
SELECT  "posts".* FROM "posts" WHERE "posts"."author_id" = ? AND "posts"."id" = ? LIMIT 1  [["author_id", 1], ["id", 1]]
---
  def edit
    if params[:author_id] #when editing, it looks to see if the params entered include an author_id
      author = Author.find_by(id: params[:author_id]) #if it does, it sets the author with that author_id as the author being played with
      if author.nil? #if there isn't an author with that author_id
        redirect_to authors_path, alert: "Author Not Found" #sends us back to the index view with all the authors and tells us that the author wasn't found
      else
        @post = author.posts.find_by(id: params) #if it is able to find an author then it sets the current post being played with to the post for that author that has the id that was entered